#!/usr/bin/perl -s

###############################################################################
use FileHandle;

###############################################################################
#
sub readAlignSpecPair {
    my($filename) = @_;
    my($info);
    my($sp1, $sp2);
    my($fh);

    $info = {};
    $info->{"PAIR"} = {};
    $info->{"SPEC"} = {};

    $fh = new FileHandle("$filename") || die("Can not open $filename($!)");
    while(<$fh>) {
        chomp();

        next if (/^\s*$/);

        s#^\s*##;       # 行頭の空白文字の除去
        s#\s*$##;       # 行末の空白文字の除去
        ($sp1, $sp2) = split(/\s+/);

        #
        if ($sp1 ne '') {
            $info->{"SPEC"}->{"$sp1"} = 1;
        }

        if ($sp2 ne '') {
            $info->{"SPEC"}->{"$sp2"} = 1;

            #
            if ($sp1 ne '') {
                # 生物種対が記述されていた場合
                $info->{"PAIR"}->{"$sp1"}->{"$sp2"} = 1;
            }
        }

    }
    $fh->close();

    return $info;
}

###############################################################################
1;#
###############################################################################
